In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [36]:
titanic = sns.load_dataset("titanic")
data=titanic

In [37]:
# data.dropna(axis=0,inplace=True)

In [38]:
data.head(1)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False

In [39]:
X=data.iloc[:,1:-3]
y=data.iloc[:,0:1]

In [40]:
y.sample(2)

     survived
402         0
359         1

In [41]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, train_size=0.8, random_state=0, shuffle=True)

In [42]:
from sklearn.preprocessing import OneHotEncoder,OrdinalEncoder,LabelEncoder,StandardScaler
from sklearn.impute import SimpleImputer
from sklearn.compose import ColumnTransformer,make_column_transformer
from sklearn.pipeline import make_pipeline,Pipeline
from sklearn import set_config

In [43]:
X_test.head(1)

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck
495,3,male,NaN,0,0,14.4583,C,Third,man,True,NaN

In [44]:
X_test['deck'].unique()

[NaN, 'B', 'C', 'E', 'D', 'F', 'G']
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [ ]:
tran1=ColumnTransformer(transformers=[
    ('si',SimpleImputer(fill_value='mean'),[2])
    ],remainder='passthrough')

In [ ]:
tran2=ColumnTransformer(transformers=[
    ('si',SimpleImputer(fill_value='most_frequent'),[6])
    ],remainder='passthrough')

In [ ]:
tran3=ColumnTransformer(transformers=[
    ('oht',OneHotEncoder(sparse=False,dtype=np.int16,drop='first'),[1,6,10]),
    ('oe',OrdinalEncoder(categories=[[ 'First', 'Second','Third'],[ 'child', 'woman','man']],dtype=np.int16),[7,8])
    ],remainder='passthrough')

In [ ]:
tran4=ColumnTransformer(transformers=[
    ('ss',StandardScaler(),[:])
   
    ],remainder='passthrough')